#coding:utf-8
'''
Created on 20170905

@author: lch
'''
PERIOD_NUM = (
    ('1', u'第一期'),
    ('2', u'第二期'),
    ('3', u'第三期'),
    ('4', u'第四期'),
    ('5', u'第五期'),
    ('6', u'第六期'),
    ('7', u'第七期'),
    ('8', u'第八期'),
    ('9', u'第九期'),
)




Project_TYPE = (
    ('1', u'新手投资'),
    ('2', u'稳健投资'),
    ('3', u'高收益区'),
)


AUDIT_STATE = (
    ('0', u'审核通过'),
    ('1', u'待审核'),
    ('2', u'审核未通过'),
    ('3', u'待返现'),
)

TRANS_TYPE = (
    ('0', u'增加'),
    ('1', u'减少'),
    ('2', u'其他'),
)


NEWS_TYPE = (
    ('1', u'公告'),
    ('2', u'福利攻略'),
    ('3', u'新闻'),
    ('4', u'横幅广告'),
    ('5', u'兑奖帮助'),
)




BANK = (
    ('gsyh', u'中国工商银行'),
    ('nyyh', u'中国农业银行'),
    ('zgyh', u'中国银行'),
    ('jsyh', u'中国建设银行'),
    ('jtyh', u'交通银行'),
    ('ycyh', u'中国邮政储蓄银行'),
    ('zxyh', u'中信银行'),
    ('gdyh', u'中国光大银行'),
    ('hxyh', u'华夏银行'),
    ('msyh', u'中国民生银行'),
    ('gfyh', u'广发银行股份有限公司'),
    ('payh', u'平安银行'),
    ('zsyh', u'招商银行'),
    ('xyyh', u'兴业银行'),
)
